# Негатив

# Напишите программу, которая запрашивает у пользователя число и проверяет, является ли оно
# отрицательным.
# Используйте оператор if для проверки.

# Напишите тут ваш код

print("n меньше нуля") if int(input("Введите число: ")) < 0  else print("n больше нуля")


