# Математика 8 класса

# Напишите программу, которая запрашивает у пользователя число и использует библиотеку
# math для вычисления и вывода квадратного корня и факториала этого числа.

# Напишите тут ваш код

import math

n = int(input())

print(math.sqrt(n))
print(math.factorial(n))