# Кто хочет добавки?

# Напишите программу, которая создает пустой список, затем запрашивает у
# пользователя 5 элементов и добавляет их в список с помощью метода append().
# После этого программа должна вывести итоговый список.

# Напишите тут ваш код

list_in = []
for i in range(5):
    list_in.append(input("введите строку: "))
print(list_in)