# Ошибка с отступами.

# Напиши программу, которая создает исключение IndentationError

# Напишите тут ваш код
lst =[1, 2]
# if lst:
#     if type(lst[1]) == int:
# #    print(lst[1])




# Синтаксическая ошибка.

# Напиши программу, которая создает исключение SyntaxError

# Напишите тут ваш код

#
# s = int('1', ))