# Обратный кортеж

# Напишите программу, которая создает кортеж из произвольного количества
# элементов, запрашиваемых у пользователя.
# Затем программа должна вывести кортеж в обратном
# порядке с использованием среза.

# Напишите тут ваш код

t = tuple(input().split())
print(t[::-1])