# Тернарный оператор

# Напишите программу, которая запрашивает у пользователя число и использует тернарный оператор для проверки, является ли оно четным или нечетным.
# Выведите соответствующее сообщение.

# Напишите тут ваш код

print("четное" if int(input()) % 2 == 0 else "нечетное")