# Ты ему слово, он тебе ссылку

# Напишите программу, которая создает два списка,
# присваивает один из них другой переменной и проверяет,
# указывают ли обе переменные на один и тот же объект.
# Используйте оператор is для проверки ссылок.

# Напишите тут ваш код

my_lst_in = [1, 2, 3]
my_lst_out = my_lst_in

print(my_lst_in is my_lst_out)