# Распаковка

# Напишите программу, которая создает кортеж из 3 элементов
# (например, имя, возраст, город).
# Затем программа должна распаковать кортеж в отдельные переменные
# и вывести каждую переменную.

# Напишите тут ваш код

tuple_in = ("Jonson", 49, "Moscow")

name, age, citi = tuple_in

print(name, age, citi)
