# Деление на ноль.

# Напиши программу, которая создает исключение ZeroDivisionError

# Напишите тут ваш код


def division(a: int, b: int) -> int:
    return a / b


print(division(5, 0))


# Напиши программу, которая создает исключение TypeError

# Напишите тут ваш код


def division(a: int, b: int) -> int:
    return a / b


print(division(5, '5'))


