# Welcome

# Создайте переменную name и присвойте ей ваше имя.
# Выведите сообщение "Привет, {имя}" используя функцию print() и вашу переменную.

# Напишите тут ваш код

name = "Дмитрий"

print(f"Привет, {name}")