# Установка пакетов с помощью pip

# Используйте пакетный менеджер pip для установки, обновления и удаления пакетов.
# Выполните следующие шаги:
# Проверьте установлен ли pip.
# Установите пакет requests.
# Установите конкретную версию пакета numpy (версия 1.21.0).
# Обновите пакет requests до последней версии.
# Удалите пакет requests.
# Список всех установленных пакетов.


# # Напишите тут ваш код:
# # Проверка, установлен ли pip
# pip --version
# # Установка пакета requests
# pip install requests
# # Установка конкретной версии numpy
# pip install numpy==1.21.0
# # Обновление пакета requests до последней версии
# pip install --upgrade requests
# # Удаление пакета requests
# pip uninstall requests -y
# # Список всех установленных пакетов
# pip list





# Создание и управление средами с помощью conda

# Используйте пакетный менеджер conda для создания и управления изолированными средами.
# Выполните следующие шаги:
# Создайте новую среду под названием myenv.
# Активируйте среду myenv.
# Установите пакет numpy в среду myenv.
# Отобразите список всех установленных пакетов в среде myenv.
# Деактивируйте среду myenv.

# # Напишите тут ваш код
# # Создание новой среды
# conda create --name myenv
# # Активация среды
# conda activate myenv
# # Установка пакета numpy в среду
# conda install numpy
# # Отображение списка всех установленных пакетов в среде
# conda list
# # Деактивация среды
# conda deactivate

