# Срезы

# Напишите программу, которая создает список из 10 элементов,
# выводит элементы с третьего по седьмой включительно с использованием срезов
# и выводит последние три элемента списка с использованием отрицательных индексов.

# Напишите тут ваш код

list_in = [i for i in range(10)]
print(list_in[3:8])
print(list_in[-3:])