# Все не так однозначно.

# Напиши программу, которая делит целое число на целое.
# Выведи на экран тип результата.

# Напишите тут ваш код

rez = 100 / 50
t = type(rez)
print(t)